Revit 2027 API
ExporterIFCUtils.GetOriginalSymbol Method
 Returns the original family symbol of this family instance, before the instance is modified by joins, cuts, coping, extensions, or other post-processing.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FamilySymbol GetOriginalSymbol(
	FamilyInstance familyInstance
)
Public Shared Function GetOriginalSymbol (
	familyInstance As FamilyInstance
) As FamilySymbol
public:
static FamilySymbol^ GetOriginalSymbol(
	FamilyInstance^ familyInstance
)
static member GetOriginalSymbol :
        familyInstance : FamilyInstance -> FamilySymbol
Parameters
familyInstance FamilyInstance
 The FamilyInstance.
Return Value
FamilySymbol
 The original FamilySymbol.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace